###############################################################################
# Created by write_sdc
# Thu Jul 18 16:24:28 2024
###############################################################################
current_design mcu
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
