
set_db init_lib_search_path {/home/metin/libs/} 
set_db init_hdl_search_path {/home/metin/GENUS/metinardakoker/} 
set_db library {sky130_fd_sc_hd__tt_025C_1v80.lib}
set_db hdl_max_memory_address_range 32768

read_hdl -sv {./cv32e40p/vendor/pulp_platform_common_cells/include/common_cells/assertions.svh ./cv32e40p/vendor/pulp_platform_common_cells/include/common_cells/registers.svh ./cv32e40p/vendor/pulp_platform_common_cells/src/cf_math_pkg.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/ecc_pkg.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/cb_filter_pkg.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_pkg.sv ./cv32e40p/vendor/pulp_platform_fpu_div_sqrt_mvp/hdl/defs_div_sqrt_mvp.sv ./cv32e40p/include/cv32e40p_pkg.sv ./cv32e40p/include/cv32e40p_apu_core_pkg.sv ./cv32e40p/include/cv32e40p_fpu_pkg.sv ./cv32e40p/cv32e40p_alu.sv ./cv32e40p/vendor/pulp_platform_fpu_div_sqrt_mvp/hdl/nrbd_nrsc_mvp.sv ./cv32e40p/vendor/pulp_platform_fpu_div_sqrt_mvp/hdl/norm_div_sqrt_mvp.sv ./cv32e40p/vendor/pulp_platform_fpu_div_sqrt_mvp/hdl/div_sqrt_top_mvp.sv ./cv32e40p/vendor/pulp_platform_fpu_div_sqrt_mvp/hdl/div_sqrt_mvp_wrapper.sv ./cv32e40p/vendor/pulp_platform_fpu_div_sqrt_mvp/hdl/preprocess_mvp.sv ./cv32e40p/vendor/pulp_platform_fpu_div_sqrt_mvp/hdl/iteration_div_sqrt_mvp.sv ./cv32e40p/vendor/pulp_platform_fpu_div_sqrt_mvp/hdl/control_mvp.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/plru_tree.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/binary_to_gray.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_register.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_mux.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/counter.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/gray_to_binary.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/max_counter.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/ecc_encode.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_filter.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/lzc.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/cdc_fifo_2phase.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/edge_propagator.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/lfsr_8bit.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/spill_register.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/edge_detect.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_arbiter.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/ecc_decode.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/id_queue.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/mv_filter.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/addr_decode.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_xbar.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/fifo_v3.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/rstgen.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/serial_deglitch.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/sync.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/unread.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_fork.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_omega_net.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/rstgen_bypass.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/delta_counter.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/onehot_to_bin.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/edge_propagator_tx.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_join.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/lfsr.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/fall_through_register.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/rr_arb_tree.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/shift_reg.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/popcount.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_to_mem.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_delay.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_fifo.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/isochronous_spill_register.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/lfsr_16bit.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/cdc_2phase.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/cdc_fifo_gray.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/exp_backoff.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_demux.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/cb_filter.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/edge_propagator_rx.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_fork_dynamic.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/sub_per_hash.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_intf.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/sync_wedge.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/stream_arbiter_flushable.sv ./cv32e40p/vendor/pulp_platform_common_cells/src/clk_div.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_classifier.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_divsqrt_multi.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_rounding.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_cast_multi.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_noncomp.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_opgroup_fmt_slice.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_fma_multi.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_divsqrt_th_32.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_fma.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_top.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_opgroup_multifmt_slice.sv ./cv32e40p/vendor/pulp_platform_fpnew/src/fpnew_opgroup_block.sv ./cv32e40p/cv32e40p_compressed_decoder.sv ./cv32e40p/cv32e40p_top.sv ./cv32e40p/cv32e40p_controller.sv ./cv32e40p/cv32e40p_obi_interface.sv ./cv32e40p/cv32e40p_id_stage.sv ./cv32e40p/cv32e40p_popcnt.sv ./cv32e40p/cv32e40p_load_store_unit.sv ./cv32e40p/cv32e40p_int_controller.sv ./cv32e40p/cv32e40p_core.sv ./cv32e40p/cv32e40p_alu_div.sv ./cv32e40p/cv32e40p_fifo.sv ./cv32e40p/cv32e40p_aligner.sv ./cv32e40p/cv32e40p_prefetch_controller.sv ./cv32e40p/cv32e40p_apu_disp.sv ./cv32e40p/cv32e40p_prefetch_buffer.sv ./cv32e40p/cv32e40p_mult.sv ./cv32e40p/cv32e40p_hwloop_regs.sv ./cv32e40p/cv32e40p_register_file_ff.sv ./cv32e40p/cv32e40p_cs_registers.sv ./cv32e40p/cv32e40p_ff_one.sv ./cv32e40p/cv32e40p_fp_wrapper.sv ./cv32e40p/cv32e40p_decoder.sv ./cv32e40p/cv32e40p_sleep_unit.sv ./cv32e40p/cv32e40p_ex_stage.sv ./cv32e40p/cv32e40p_if_stage.sv}
read_hdl {./mcu.v ./data_mem.v ./bus.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/clk/rtl/gated_clk_cell.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fpu/rtl/pa_fpu_dp.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fpu/rtl/pa_fpu_src_type.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fpu/rtl/pa_fpu_frbus.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fdsu/rtl/pa_fdsu_ff1.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fdsu/rtl/pa_fdsu_special.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fdsu/rtl/pa_fdsu_round_single.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fdsu/rtl/pa_fdsu_pack_single.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fdsu/rtl/pa_fdsu_srt_single.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fdsu/rtl/pa_fdsu_top.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fdsu/rtl/pa_fdsu_ctrl.v ./cv32e40p/vendor/pulp_platform_fpnew/vendor/opene906/E906_RTL_FACTORY/gen_rtl/fdsu/rtl/pa_fdsu_prepare.v ./cv32e40p/cv32e40p_clock_gate.v ./perip_mem.v ./clk_gen.v ./rom.v ./protocols/USB/usb_mem.v ./protocols/USB/USB.v ./protocols/USB/usb_class/usb_camera_top.v ./protocols/USB/usb_class/usb_keyboard_top.v ./protocols/USB/usb_class/usb_disk_top.v ./protocols/USB/usb_class/usb_audio_top.v ./protocols/USB/usb_class/usb_serial_top.v ./protocols/USB/usbfs_core/usbfs_core_top.v ./protocols/USB/usbfs_core/usbfs_transaction.v ./protocols/USB/usbfs_core/usbfs_packet_tx.v ./protocols/USB/usbfs_core/usbfs_packet_rx.v ./protocols/USB/usbfs_core/usbfs_debug_monitor.v ./protocols/USB/usbfs_core/usbfs_bitlevel.v ./protocols/USB/usbfs_core/usbfs_debug_uart_tx.v ./protocols/timer/timer_mem.v ./protocols/timer/timer.v ./protocols/GPIO.v ./protocols/QSPI_master.v ./protocols/I2C/I2C_master.v ./protocols/UART/uart_core.v ./protocols/UART/UART.v ./protocols/UART/uart_mem.v ./instr_mem.v}


elaborate mcu
#read_sdc ../constraints/constraints_top.sdc
read_sdc ../spm.sdc


#low, medium, high, express
set_db syn_generic_effort medium
set_db syn_map_effort medium
set_db syn_opt_effort medium

syn_generic
syn_map
syn_opt

#reports
report_timing > reports/report_timing.rpt
report_power  > reports/report_power.rpt
report_area   > reports/report_area.rpt
report_qor    > reports/report_qor.rpt
 
#Outputs
#write_hdl > outputs/counter_netlist.v
write_hdl > outputs/b02_netlist.v
write_sdc > outputs/counter_sdc.sdc
write_sdf timescale ns nonegchecks recrem split -edges check_edge setuphold split outputs/delays.sdf
